In [9]:
import pandas as pd

In [10]:
# Import Data

In [11]:
data_frame = pd.read_csv('C:/Users/bhara/OneDrive/Desktop/Principles-of-DS/studentperformance/data_raw/StudentsPerformance.csv')
data_frame.head()

,gender,race/ethnicity,parental level of education,lunch,test preparation course,math score,reading score,writing score
0,female,group B,bachelor's degree,standard,none,72,72,74
1,female,group C,some college,standard,completed,69,90,88
2,female,group B,master's degree,standard,none,90,95,93
3,male,group A,associate's degree,free/reduced,none,47,57,44
4,male,group C,some college,standard,none,76,78,75

In [12]:
data_frame.describe()

       math score  reading score  writing score
count  1000.00000    1000.000000    1000.000000
mean     66.08900      69.169000      68.054000
std      15.16308      14.600192      15.195657
min       0.00000      17.000000      10.000000
25%      57.00000      59.000000      57.750000
50%      66.00000      70.000000      69.000000
75%      77.00000      79.000000      79.000000
max     100.00000     100.000000     100.000000

In [13]:
# checks for null values

In [14]:
data_frame.isnull().sum()

gender                         0
race/ethnicity                 0
parental level of education    0
lunch                          0
test preparation course        0
math score                     0
reading score                  0
writing score                  0
dtype: int64

In [15]:
# store the cleaned data to data_clean folder

In [16]:
data_frame.to_csv('C:/Users/bhara/OneDrive/Desktop/Principles-of-DS/studentperformance/data_clean/StudentsPerformance.csv')